init.org
#+PROPERTY: header-args :tangle yes :comments yes :results silent

* UI Tweaks
#+BEGIN_SRC emacs-lisp
  (menu-bar-mode -1)
#+END_SRC

* DONE Package manager / Use Package
[[help:list-packages][Help for list packages]]
** Adding more package-archives and Install use-package
#+BEGIN_SRC emacs-lisp
  (require 'package)
  (add-to-list 'package-archives
	       '("melpa-stable" . "https://stable.melpa.org/packages/") t)
  (add-to-list 'package-archives
	       '("melpa" . "https://melpa.org/packages/") t)
  (add-to-list 'package-archives
	       '("org" . "https://orgmode.org/elpa/") t)
  (package-initialize)

  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
#+END_SRC
** DONE configure use-package
#+BEGIN_SRC emacs-lisp
  (setq use-package-always-ensure t)
#+END_SRC
* TODO Figlet / Other demo staff
** TODO Figlet
** DONE Command Log mode
#+BEGIN_SRC emacs-lisp
  (use-package command-log-mode
    :commands (global-command-log-mode)
    :bind ("C-c o" . clm/toggle-command-log-buffer))
#+END_SRC
* TODO Magit
** Installing Magit
#+BEGIN_SRC emacs-lisp
  (use-package magit
    :commands (magit-status)
    :bind ("C-x g" . magit-status))
#+END_SRC
* TODO Don't as about custom variables
* TODO Make source code blocks default to ~emacs-lisp~

* Local Variables
# Local variables:
# eval: (add-hook 'after-save-hook (lambda () (org-babel-tangle)) nil t)
# End:
